translators/nativy/Auth.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <SecuredWebServiceHeader xmlns="https://www.nativy.com/nis">
      <Username>demonis@nativy.com</Username>
      <Password>A9!x57M</Password>
    </SecuredWebServiceHeader>
  </soap:Header>
  <soap:Body>
    <AuthenticateUser xmlns="https://www.nativy.com/nis" />
  </soap:Body>
</soap:Envelope>